<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"f0c007c0f97955c8f2fcfabb926f7a89ea6de1e290a57b5b0f5fda68fa16568d","plan_job_ref":"Job Create MPE Management terraform plan #99 at https://github.com/AFMPE/mpe_management/actions/runs/4929288450","plan_hash":"9b18bc647c47e2ac0b59bf7a58aade223e98e0d0d2d08a036596e1dcce64f4df","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=core-mgt-prod-tfstate            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `src/tfvars/production/parameters.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
state_sa_container_name           = (sensitive value)
state_sa_name                     = (sensitive value)
state_sa_rg                       = (sensitive value)
subscription_id_hub               = (sensitive value)
subscription_id_internal          = (sensitive value)
subscription_id_partners_gsa_dev  = (sensitive value)
subscription_id_partners_gsa_prod = (sensitive value)
subscription_id_sandbox           = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 2 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_sentinel_rule_alerts.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_threat_intelligence.dataMTI must be replaced
-/+ resource "azurerm_sentinel_data_connector_microsoft_threat_intelligence" "dataMTI" {
      + bing_safety_phishing_url_lookback_date       = "1970-01-01T00:00:00Z" # forces replacement
      ~ id                                           = "*************************************************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name                                         = "MSTI_Connector"
      ~ tenant_id                                    = "************************************" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/StorageAccounts"
      - subplan       = "PerTransaction" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/VirtualMachines"
      - subplan       = "P2" -> null
        # (2 unchanged attributes hidden)
    }

  # module.mod_codex.module.codex_loganalytics_sa.azurerm_storage_account.storage will be created
  + resource "azurerm_storage_account" "storage" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = true
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = "ampeeuscodexpublicst"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "*******"
      + resource_group_name               = "ampe-eus-codex-prod-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "*******"
      + tags                              = {
          + "deployedBy" = "AzureNoOpsTF"
          + "env"        = "public"
          + "workload"   = "codex"
        }

      + blob_properties {
          + change_feed_enabled      = true
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true

          + container_delete_retention_policy {
              + days = 30
            }

          + delete_retention_policy {
              + days = 30
            }

          + restore_policy {
              + days = 29
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + queue_properties {
          + logging {
              + delete                = true
              + read                  = true
              + retention_policy_days = 10
              + version               = "1.0"
              + write                 = true
            }
        }
    }

  # module.mod_codex.module.codex_loganalytics_sa.azurerm_storage_account_network_rules.network_rules["enabled"] will be created
  + resource "azurerm_storage_account_network_rules" "network_rules" {
      + bypass                     = [
          + "AzureServices",
          + "Logging",
          + "Metrics",
        ]
      + default_action             = "Deny"
      + id                         = (known after apply)
      + ip_rules                   = (known after apply)
      + storage_account_id         = (known after apply)
      + virtual_network_subnet_ids = (known after apply)
    }

Plan: 3 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #99](https://github.com/AFMPE/mpe_management/actions/runs/4929288450)